<a id="top">

# Table Of Contents

- [arrange()](#arrange)
- [filter()](#filter)

In [18]:
import numpy as np
import pandas as pd
from plydata import *

In [3]:
import pandas as pd
data = pd.DataFrame({'group': ['a', 'a', 'a', 'b','b', 'b', 'c', 'c','c'],
                 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

  group  ounces
0     a     4.0
1     a     3.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0

<a id="arrange">

# ```arrange()``` examples

[[back to top](#top)]

### Sort rows by a particular column:

In [6]:
data >> arrange('ounces')

  group  ounces
1     a     3.0
6     c     3.0
0     a     4.0
7     c     5.0
3     b     6.0
8     c     6.0
4     b     7.5
5     b     8.0
2     a    12.0

### Sort rows by more than one column:

In [9]:
data >> arrange('group','ounces')

  group  ounces
1     a     3.0
0     a     4.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0

### To sort a column in descending order, prefix with a minus/- sign:

In [15]:
arrange(data, 'group','1-ounces')

  group  ounces
2     a    12.0
0     a     4.0
1     a     3.0
5     b     8.0
4     b     7.5
3     b     6.0
8     c     6.0
7     c     5.0
6     c     3.0

# ```query_at()``` examples

[[back to top](#top)]

In [20]:
df = pd.DataFrame({
     'alpha': list('aaabbb'),
     'beta': list('babruq'),
     'theta': list('cdecde'),
     'x': [1, 2, 3, 4, 5, 6],
     'y': [6, 5, 4, 3, 2, 1],
     'z': [7, 9, 11, 8, 10, 12]
 })
df

  alpha beta theta  x  y   z
0     a    b     c  1  6   7
1     a    a     d  2  5   9
2     a    b     e  3  4  11
3     b    r     c  4  3   8
4     b    u     d  5  2  10
5     b    q     e  6  1  12

In [21]:
df >> query_at(('x', 'y', 'z'), any_vars='({_} == 4)')

  alpha beta theta  x  y   z
2     a    b     e  3  4  11
3     b    r     c  4  3   8

# ```group_by()``` and ```summarize_at()``` combo

[[back to top](#top)]

In [22]:
(df
>> group_by('alpha')
>> summarize_at(('x', 'y', 'z'), 'sum'))

  alpha   x   y   z
0     a   6  15  27
1     b  15   6  30